Tekla Open API Reference for Tekla Structures 2025
Arc.Length Property
 Returns the length of the arc
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
Implements
ICurve.Length
See Also
Reference
Arc Class
Tekla.Structures.Geometry3d Namespace